Revit 2027 API
NumberingSchema.MergeSequences Method
Note: This API is now obsolete.
 Merges all elements from given numbering sequences to a new sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")]
public void MergeSequences(
	IList<string> sourcePartitions,
	string newPartition
)
<ObsoleteAttribute("<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")>
Public Sub MergeSequences (
	sourcePartitions As IList(Of String),
	newPartition As String
)
public:
[ObsoleteAttribute(L"<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")]
void MergeSequences(
	IList<String^>^ sourcePartitions,
	String^ newPartition
)
[<ObsoleteAttribute("<p>This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories.</p>")>]
member MergeSequences :
        sourcePartitions : IList<string> *
        newPartition : string -> unit
Parameters
sourcePartitions IList<String>
 A collection of partition names identifying the sequences to be merged together. There must be at least two names in the list. All the sequences must exist already.
newPartition String
 Name of a new partition into which the source sequences will be merged. Leading and trailing white space is ignored in the given string and will be removed automatically.
Exceptions
Exception | Condition
ArgumentException |  The sourcePartitions list must contain at least two names. -or- Either one or more sequences in the sourcePartitions list does not exist in the schema, or the list contains duplicated names. -or- The sequence newPartition does already exist in the schema. -or- the given newPartition cannot be used as a valid name of a numbering partition because it contains characters that are considered invalid, such as non-printable characters or those that cannot be used in a file's name.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Either the schema or its document cannot be modified at present. -or- The input element/s in not a Rebar, an Reinforcement or a Coupler. -or- Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM parameter assigned. It may be an indication that the element is not free to be edited at present.
Remarks
Upon a successful merge, all elements in the new merged sequence will be renumbered in order of the element creation. There will be no gaps.
There must not be a sequence for the target partition in the schema yet, otherwise an exception will be thrown.
This operation modifies the Partition parameter of all elements in the sequences that are being merged. Therefore, all its elements must be accessible for editing, otherwise this operation will fail.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace